package com.ydl.api;

import com.ydl.entity.BasicRuralConditions;
import com.ydl.entity.EconomicData;
import com.ydl.service.BasicRuralConditionsService;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.web.bind.annotation.PostMapping;
import org.springframework.web.bind.annotation.RequestBody;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RestController;

@RestController
@RequestMapping("BasicRuralConditions")
public class BasicRuralConditionsApi {
    @Autowired
    BasicRuralConditionsService basicRuralConditionsService;
    /**@apiName BasicRuralConditions_getDataByTableName
     * @api {POST} BasicRuralConditions/getDataByTableName 农村基本情况
     * @apiGroup 经济数据
     * @apiVersion 0.0.2
     * @apiDescription 用于获取农村基本情况统计的数据
     * @apiParam {JSON} tableName 表名字
     * @apiParamExample {json} 请求样例：
     *{
     * 	"tableName":"经济数据.玉林市历年兴业县生产总值统计1998_2016"
     * }
     * @apiSuccess (200) {String} msg 信息
     * @apiSuccessExample {json} 返回样例:
     * [
     *     {
     *         "编号": 1,
     *         "县市区": "玉林市",
     *         "乡镇个数个": 102,
     *         "村民委员会个": 1346,
     *         "居民委员会个": 120,
     *         "村民小组个": 31474,
     *         "自来水受益村数个": 955,
     *         "通有线电视村数个": 1312,
     *         "通宽带村数个": 1339,
     *         "乡镇村户数万户": 132.0,
     *         "乡镇村人口数万人": 572.02,
     *         "乡镇村人口数男万人": 300.81,
     *         "乡镇村人口数女万人": 271.21,
     *         "乡镇村劳动力资源数万人": 353.61,
     *         "乡镇村劳动力资源数男万人": 188.31,
     *         "乡镇村劳动力资源数女万人": 165.3,
     *         "乡镇村从业人员数万人": 324.5,
     *         "乡镇村从业人员数男万人": 172.61,
     *         "乡镇村从业人员数农业从业人员万人": 102.57,
     *         "乡镇村从业人员数女万人": 151.89,
     *         "乡镇村从业人员数农业从业人员万人1": 86.19,
     *         "耕地公顷": 238657,
     *         "园地公顷": 144383,
     *         "林地公顷": 674610,
     *         "草地公顷": 33225,
     *         "设施农业用地公顷": 2119
     *     },
     *     {
     *         "编号": 2,
     *         "县市区": "玉州区",
     *         "乡镇个数个": 4,
     *         "村民委员会个": 59,
     *         "居民委员会个": 36,
     *         "村民小组个": 1952,
     *         "自来水受益村数个": 81,
     *         "通有线电视村数个": 82,
     *         "通宽带村数个": 82,
     *         "乡镇村户数万户": 10.0,
     *         "乡镇村人口数万人": 42.0,
     *         "乡镇村人口数男万人": 23.0,
     *         "乡镇村人口数女万人": 19.0,
     *         "乡镇村劳动力资源数万人": 26.0,
     *         "乡镇村劳动力资源数男万人": 14.0,
     *         "乡镇村劳动力资源数女万人": 11.0,
     *         "乡镇村从业人员数万人": 20.0,
     *         "乡镇村从业人员数男万人": 11.0,
     *         "乡镇村从业人员数农业从业人员万人": 8.0,
     *         "乡镇村从业人员数女万人": 9.0,
     *         "乡镇村从业人员数农业从业人员万人1": 5.0,
     *         "耕地公顷": 9714,
     *         "园地公顷": 4007,
     *         "林地公顷": 12015,
     *         "草地公顷": 14,
     *         "设施农业用地公顷": 20
     *     },
     *     {
     *         "编号": 3,
     *         "县市区": "福绵区",
     *         "乡镇个数个": 6,
     *         "村民委员会个": 116,
     *         "居民委员会个": null,
     *         "村民小组个": 2463,
     *         "自来水受益村数个": 100,
     *         "通有线电视村数个": 116,
     *         "通宽带村数个": 116,
     *         "乡镇村户数万户": 10.42,
     *         "乡镇村人口数万人": 39.33,
     *         "乡镇村人口数男万人": 21.15,
     *         "乡镇村人口数女万人": 18.18,
     *         "乡镇村劳动力资源数万人": 22.95,
     *         "乡镇村劳动力资源数男万人": 12.37,
     *         "乡镇村劳动力资源数女万人": 10.58,
     *         "乡镇村从业人员数万人": 20.94,
     *         "乡镇村从业人员数男万人": 11.53,
     *         "乡镇村从业人员数农业从业人员万人": 8.79,
     *         "乡镇村从业人员数女万人": 9.41,
     *         "乡镇村从业人员数农业从业人员万人1": 3.22,
     *         "耕地公顷": 19589,
     *         "园地公顷": 14030,
     *         "林地公顷": 28584,
     *         "草地公顷": 2466,
     *         "设施农业用地公顷": 411
     *     },
     *     {
     *         "编号": 4,
     *         "县市区": "容县",
     *         "乡镇个数个": 15,
     *         "村民委员会个": 213,
     *         "居民委员会个": 14,
     *         "村民小组个": 5546,
     *         "自来水受益村数个": 72,
     *         "通有线电视村数个": 201,
     *         "通宽带村数个": 213,
     *         "乡镇村户数万户": 19.64,
     *         "乡镇村人口数万人": 73.38,
     *         "乡镇村人口数男万人": 37.22,
     *         "乡镇村人口数女万人": 36.16,
     *         "乡镇村劳动力资源数万人": 45.11,
     *         "乡镇村劳动力资源数男万人": 23.05,
     *         "乡镇村劳动力资源数女万人": 22.06,
     *         "乡镇村从业人员数万人": 41.88,
     *         "乡镇村从业人员数男万人": 21.58,
     *         "乡镇村从业人员数农业从业人员万人": 11.1,
     *         "乡镇村从业人员数女万人": 20.3,
     *         "乡镇村从业人员数农业从业人员万人1": 11.07,
     *         "耕地公顷": 29131,
     *         "园地公顷": 31158,
     *         "林地公顷": 139812,
     *         "草地公顷": 2516,
     *         "设施农业用地公顷": 124
     *     },
     *     {
     *         "编号": 5,
     *         "县市区": "陆川县",
     *         "乡镇个数个": 14,
     *         "村民委员会个": 154,
     *         "居民委员会个": 10,
     *         "村民小组个": 4529,
     *         "自来水受益村数个": 72,
     *         "通有线电视村数个": 119,
     *         "通宽带村数个": 139,
     *         "乡镇村户数万户": 18.16,
     *         "乡镇村人口数万人": 82.86,
     *         "乡镇村人口数男万人": 43.18,
     *         "乡镇村人口数女万人": 39.68,
     *         "乡镇村劳动力资源数万人": 53.71,
     *         "乡镇村劳动力资源数男万人": 28.55,
     *         "乡镇村劳动力资源数女万人": 25.16,
     *         "乡镇村从业人员数万人": 48.45,
     *         "乡镇村从业人员数男万人": 26.05,
     *         "乡镇村从业人员数农业从业人员万人": 16.75,
     *         "乡镇村从业人员数女万人": 22.4,
     *         "乡镇村从业人员数农业从业人员万人1": 14.83,
     *         "耕地公顷": 33448,
     *         "园地公顷": 9640,
     *         "林地公顷": 75922,
     *         "草地公顷": 10714,
     *         "设施农业用地公顷": 273
     *     },
     *     {
     *         "编号": 6,
     *         "县市区": "博白县",
     *         "乡镇个数个": 28,
     *         "村民委员会个": 316,
     *         "居民委员会个": 41,
     *         "村民小组个": 8483,
     *         "自来水受益村数个": 143,
     *         "通有线电视村数个": 316,
     *         "通宽带村数个": 316,
     *         "乡镇村户数万户": 31.07,
     *         "乡镇村人口数万人": 150.83,
     *         "乡镇村人口数男万人": 79.56,
     *         "乡镇村人口数女万人": 71.27,
     *         "乡镇村劳动力资源数万人": 91.73,
     *         "乡镇村劳动力资源数男万人": 49.56,
     *         "乡镇村劳动力资源数女万人": 42.17,
     *         "乡镇村从业人员数万人": 91.56,
     *         "乡镇村从业人员数男万人": 48.98,
     *         "乡镇村从业人员数农业从业人员万人": 28.68,
     *         "乡镇村从业人员数女万人": 42.58,
     *         "乡镇村从业人员数农业从业人员万人1": 25.58,
     *         "耕地公顷": 71734,
     *         "园地公顷": 19983,
     *         "林地公顷": 233802,
     *         "草地公顷": 8402,
     *         "设施农业用地公顷": 438
     *     },
     *     {
     *         "编号": 7,
     *         "县市区": "兴业县",
     *         "乡镇个数个": 13,
     *         "村民委员会个": 210,
     *         "居民委员会个": 4,
     *         "村民小组个": 3903,
     *         "自来水受益村数个": 210,
     *         "通有线电视村数个": 210,
     *         "通宽带村数个": 195,
     *         "乡镇村户数万户": 15.66,
     *         "乡镇村人口数万人": 64.77,
     *         "乡镇村人口数男万人": 35.04,
     *         "乡镇村人口数女万人": 29.73,
     *         "乡镇村劳动力资源数万人": 39.12,
     *         "乡镇村劳动力资源数男万人": 21.23,
     *         "乡镇村劳动力资源数女万人": 17.89,
     *         "乡镇村从业人员数万人": 36.49,
     *         "乡镇村从业人员数男万人": 19.57,
     *         "乡镇村从业人员数农业从业人员万人": 11.27,
     *         "乡镇村从业人员数女万人": 16.92,
     *         "乡镇村从业人员数农业从业人员万人1": 9.75,
     *         "耕地公顷": 33762,
     *         "园地公顷": 18508,
     *         "林地公顷": 66880,
     *         "草地公顷": 2715,
     *         "设施农业用地公顷": 714
     *     },
     *     {
     *         "编号": 8,
     *         "县市区": "北流市",
     *         "乡镇个数个": 22,
     *         "村民委员会个": 278,
     *         "居民委员会个": 15,
     *         "村民小组个": 4598,
     *         "自来水受益村数个": 277,
     *         "通有线电视村数个": 268,
     *         "通宽带村数个": 278,
     *         "乡镇村户数万户": 27.09,
     *         "乡镇村人口数万人": 118.96,
     *         "乡镇村人口数男万人": 62.13,
     *         "乡镇村人口数女万人": 56.83,
     *         "乡镇村劳动力资源数万人": 75.39,
     *         "乡镇村劳动力资源数男万人": 39.21,
     *         "乡镇村劳动力资源数女万人": 36.18,
     *         "乡镇村从业人员数万人": 64.83,
     *         "乡镇村从业人员数男万人": 34.04,
     *         "乡镇村从业人员数农业从业人员万人": 17.7,
     *         "乡镇村从业人员数女万人": 30.79,
     *         "乡镇村从业人员数农业从业人员万人1": 16.4,
     *         "耕地公顷": 41279,
     *         "园地公顷": 47057,
     *         "林地公顷": 117595,
     *         "草地公顷": 6398,
     *         "设施农业用地公顷": 139
     *     }
     * ]
     */
    @PostMapping(value = "/getDataByTableName")
    public Object data(@RequestBody EconomicData economicData) {
        System.out.println(economicData.getTableName());
        return basicRuralConditionsService.getDataByTableName(economicData);
    }
}
